fooapi-console/out/results.txt
Running 20s test @ http://api/weatherforecast
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    25.36ms   28.50ms 538.35ms   95.46%
    Req/Sec     1.47k   426.86     3.56k    78.91%
  Latency Distribution
     50%   20.32ms
     75%   27.51ms
     90%   39.06ms
     99%  111.33ms
  337869 requests in 20.08s, 213.07MB read
Requests/sec:  16825.91
Transfer/sec:     10.61MB